# Werkcollege-opdrachten Week 1.3

## Dependencies importeren

Kopieer in het codeblok hieronder van het vorige werkcollege de import-code voor de dependencies die het vaakst worden gebruikt om data in te lezen. Geef er ook de gebruikelijke aliassen aan.<br>
Zet eventuele warnings uit.

In [1]:
import pandas as pd
import sqlite3
import warnings
warnings.simplefilter('ignore')

FZet de volgende bestanden in een makkelijk te vinden map, als je dat nog niet gedaan hebt:
- go_sales.sqlite
- go_crm.sqlite
- go_staff.sqlite

## Databasetabellen inlezen

Kopieer in het codeblok hieronder van het vorige werkcollege de code om een connectie met het bestand go_sales.sqlite te maken.

In [2]:
conn = sqlite3.connect("go_sales.sqlite")

Lees van de ingelezen go_sales-database te volgende tabellen in met behulp van "SELECT * FROM *tabel*".
- product
- product_type
- product_line
- sales_staff
- sales_branch
- retailer_site
- country
- order_header
- order_details
- returned_item
- return_reason

In [3]:
query = "SELECT * FROM product"
df = pd.read_sql_query(query, conn)

Krijg je een "no such table" error? Dan heb je misschien met .connect() per ongeluk een leeg  databasebestand (.sqlite) aangemaakt.<br> <u>Let op:</u> lees eventueel de informatie uit het vorige werkcollege nog eens goed door.

Als je tijdens onderstaande opdrachten uit het oog verliest welke tabellen er allemaal zijn, kan je deze Pythoncode uitvoeren:

In [4]:
sql_query = "SELECT * FROM sqlite_master WHERE type='table';"
#Vul dit codeblok verder in
pd.read_sql(sql_query, conn)
#Op de puntjes hoort de connectie naar go_sales óf go_staff óf go_crm te staan.

,type,name,tbl_name,rootpage,sql
0,table,country,country,480,"CREATE TABLE ""country"" (\n\t""COUNTRY_CODE""\tIN..."
1,table,order_details,order_details,11,"CREATE TABLE ""order_details"" (\n\t""ORDER_DETAI..."
2,table,order_header,order_header,24,"CREATE TABLE ""order_header"" (\n\t""ORDER_NUMBER..."
3,table,order_method,order_method,27,"CREATE TABLE ""order_method"" (\n\t""ORDER_METHOD..."
4,table,product,product,28,"CREATE TABLE ""product"" (\n\t""PRODUCT_NUMBER""\t..."
5,table,product_line,product_line,17,"CREATE TABLE ""product_line"" (\n\t""PRODUCT_LINE..."
6,table,product_type,product_type,10,"CREATE TABLE ""product_type"" (\n\t""PRODUCT_TYPE..."
7,table,retailer_site,retailer_site,18,"CREATE TABLE ""retailer_site"" (\n\t""RETAILER_SI..."
8,table,return_reason,return_reason,30,"CREATE TABLE ""return_reason"" (\n\t""RETURN_REAS..."
9,table,returned_item,returned_item,31,"CREATE TABLE ""returned_item"" (\n\t""RETURN_CODE..."
10,table,sales_branch,sales_branch,2,"CREATE TABLE ""sales_branch"" (\n\t""SALES_BRANCH..."
11,table,sales_staff,sales_staff,3,"CREATE TABLE ""sales_staff"" (\n\t""SALES_STAFF_C..."

Let op! Voor alle onderstaande opdrachten mag je <u>alleen Python</u> gebruiken, <u>geen SQL!</u>

## Selecties op één tabel zonder functies

Geef een overzicht met daarin de producten en hun productiekosten waarvan de productiekosten lager dan 100 dollar en hoger dan 50 dollar ligt. (2 kolommen, 23 rijen)

In [5]:
producten = pd.read_sql("select * from product", conn)
producten
overzicht = producten.loc[
    (producten["PRODUCTION_COST"] < 100) & (producten["PRODUCTION_COST"] > 50),
    ["PRODUCT_NAME", "PRODUCTION_COST"]
]
# len(overzicht)
overzicht

                        PRODUCT_NAME  PRODUCTION_COST
5          TrailChef Deluxe Cook Set            85.11
7             TrailChef Double Flame            75.00
16                   Hibernator Lite            60.00
17                        Hibernator            86.00
19   Hibernator Self - Inflating Mat            78.55
22               Hibernator Camp Cot            65.33
23      Canyon Mule Climber Backpack            62.50
45           Granite Climbing Helmet            52.86
47             Husky Harness Extreme            55.00
57                    Granite Hammer            57.13
68                         Polar Ice            73.33
69                      Polar Sports            80.00
70                        Polar Wave            60.00
71                     Polar Extreme            72.50
74                      Edge Extreme            80.00
77                         Seeker 35            79.19
78                         Seeker 50            92.58
79                    Seeker Extreme            94.12
82                    Glacier Deluxe            56.25
83                       Glacier GPS            78.55
109                Blue Steel Putter            60.00
110            Blue Steel Max Putter            81.80
113              Course Pro Golf Bag            80.00

Geef een overzicht met daarin de producten en hun marge waarvan de marge lager dan 20 % of hoger dan 60 % ligt. (2 kolommen, 7 rijen)

In [6]:
marge = pd.read_sql("select * from product", conn)
overzicht = marge.loc[
    (marge["MARGIN"] < 0.20) | (marge["MARGIN"] > 0.60),
    ["PRODUCT_NAME", "MARGIN"]
]
len(overzicht)
overzicht

                    PRODUCT_NAME  MARGIN
20                Hibernator Pad    0.17
23  Canyon Mule Climber Backpack    0.17
85             BugShield Natural    0.67
86               BugShield Spray    0.67
87         BugShield Lotion Lite    0.70
88              BugShield Lotion    0.63
89             BugShield Extreme    0.63

Geef een overzicht met daarin de landen waar met francs wordt betaald. Sorteer de uitkomst op land.  (1 kolom, 3 rijen)

In [7]:
francs = pd.read_sql("select * from country", conn)
francs.loc[
    francs["CURRENCY_NAME"] == "francs",
    ["COUNTRY"]
].sort_values("COUNTRY")

        COUNTRY
15      Belgium
0        France
7   Switzerland

Geef een overzicht met daarin de verschillende introductiedatums waarop producten met meer dan 50% marge worden geïntroduceerd (1 kolom, 7 rijen)

In [8]:
introDatum = pd.read_sql("select * from product", conn)
overzicht = introDatum.loc[
    introDatum["MARGIN"] > 0.5,
    ["INTRODUCTION_DATE", "MARGIN"]
]
overzicht
# meer dan 7 rijen. Het is 17. fout in opdracht

    INTRODUCTION_DATE  MARGIN
66         2000-10-26    0.51
85         1995-02-15    0.67
86         1995-02-15    0.67
87         1995-02-15    0.70
88         1995-02-15    0.63
89         1995-02-15    0.63
90         1995-02-15    0.60
91         1995-02-15    0.60
92         1995-02-15    0.60
93         1995-02-15    0.60
98         1995-02-15    0.60
101        2003-12-10    0.51
103        2003-12-18    0.51
104        2003-12-27    0.55
106        2004-01-13    0.55
110        2003-12-15    0.55
113        2003-12-15    0.60

Geef een overzicht met daarin het eerste adres en de stad van verkoopafdelingen waarvan zowel het tweede adres als de regio bekend is (2 kolommen, 7 rijen)

In [9]:
afd = pd.read_sql("select * from sales_branch", conn)

overzicht = afd.loc[
    afd["ADDRESS2"].notna() & afd["REGION"].notna(),
    ["ADDRESS1", "CITY"]
]

overzicht

                            ADDRESS1              CITY
2                Singelgravenplein 4         Amsterdam
13  Prol. Paseo de la Reforma No. 51  Distrito Federal
14               202-2-3 Hyakunincho             Tokyo
15                     543-225 Asahi        Osaka City
16                  2315 Queen's Ave         Melbourne
18             Avenida Paulista, 333         São Paulo
24                    3 Albany Court        Birmingham

Geef een overzicht met daarin de landen waar met dollars (dollars of new dollar) wordt betaald. Sorteer de uitkomst op land. (1 kolom, 4 rijen)

In [10]:
country = pd.read_sql("select * from country", conn)

overzicht = country.loc[
    country["CURRENCY_NAME"].str.contains("dollar|new dollar", case=False, na=False),
    ["COUNTRY"]
].drop_duplicates().sort_values("COUNTRY")

overzicht

          COUNTRY
14      Australia
3          Canada
11         Taiwan
2   United States

Geef een overzicht met daarin beide adressen en de stad van vestigingen van klanten waarvan de postcode begint met een ‘D’ (van duitsland). Filter op vestigingen die een tweede adres hebben. (3 kolommen, 2 rijen)

In [11]:
sites = pd.read_sql("select * from retailer_site", conn)

overzicht = sites.loc[
    sites["POSTAL_ZONE"].astype(str).str.startswith("D", na=False) & sites["ADDRESS2"].notna(),
    ["ADDRESS1", "ADDRESS2", "CITY"]
]
overzicht

            ADDRESS1       ADDRESS2       CITY
31  Röntgenstraße 90  3. Tür rechts  Frankfurt
59   Grubesallee 141       4. Stock    Hamburg

## Selecties op één tabel met functies

Geef het totaal aantal producten dat is teruggebracht (1 waarde)

In [12]:
ret = pd.read_sql("select * from returned_item", conn)
len(ret)

619

Geef het aantal regio’s waarin verkoopafdelingen gevestigd zijn. (1 waarde)

In [13]:
branches = pd.read_sql("select * from sales_branch", conn)
branches["REGION"].nunique()

15

Maak 3 variabelen:
- Een met de laagste
- Een met de hoogste
- Een met de gemiddelde (afgerond op 2 decimalen)

marge van producten (3 kolommen, 1 rij)

In [14]:
producten = pd.read_sql("select * from product", conn)

laagste = producten["MARGIN"].min()
hoogste = producten["MARGIN"].max()
gemiddelde = round(producten["MARGIN"].mean(), 2)

pd.DataFrame([{"laagste": laagste, "hoogste": hoogste, "gemiddelde": gemiddelde}])

   laagste  hoogste  gemiddelde
0     0.17      0.7         0.4

Geef het aantal vestigingen van klanten waarvan het 2e adres niet bekend is (1 waarde)

In [15]:
sites = pd.read_sql("select * from retailer_site", conn)

for site in sites.loc[sites["ADDRESS2"].isna(), "RETAILER_SITE_CODE"]:
    print(f"{site} 2e adres niet bekend")

int(sites["ADDRESS2"].isna().sum())

1 2e adres niet bekend
2 2e adres niet bekend
3 2e adres niet bekend
4 2e adres niet bekend
5 2e adres niet bekend
6 2e adres niet bekend
7 2e adres niet bekend
8 2e adres niet bekend
9 2e adres niet bekend
10 2e adres niet bekend
11 2e adres niet bekend
12 2e adres niet bekend
13 2e adres niet bekend
15 2e adres niet bekend
16 2e adres niet bekend
17 2e adres niet bekend
18 2e adres niet bekend
19 2e adres niet bekend
20 2e adres niet bekend
21 2e adres niet bekend
22 2e adres niet bekend
23 2e adres niet bekend
24 2e adres niet bekend
25 2e adres niet bekend
26 2e adres niet bekend
27 2e adres niet bekend
28 2e adres niet bekend
29 2e adres niet bekend
30 2e adres niet bekend
31 2e adres niet bekend
33 2e adres niet bekend
34 2e adres niet bekend
35 2e adres niet bekend
36 2e adres niet bekend
37 2e adres niet bekend
38 2e adres niet bekend
39 2e adres niet bekend
40 2e adres niet bekend
41 2e adres niet bekend
42 2e adres niet bekend
43 2e adres niet bekend
44 2e adres niet bekend
45 2e adres niet bekend
46 2e adres niet bekend
47 2e adres niet bekend
48 2e adres niet bekend
49 2e adres niet bekend
50 2e adres niet bekend
51 2e adres niet bekend
52 2e adres niet bekend
53 2e adres niet bekend
54 2e adres niet bekend
55 2e adres niet bekend
56 2e adres niet bekend
57 2e adres niet bekend
58 2e adres niet bekend
59 2e adres niet bekend
61 2e adres niet bekend
62 2e adres niet bekend
63 2e adres niet bekend
68 2e adres niet bekend
69 2e adres niet bekend
70 2e adres niet bekend
71 2e adres niet bekend
72 2e adres niet bekend
73 2e adres niet bekend
74 2e adres niet bekend
75 2e adres niet bekend
76 2e adres niet bekend
77 2e adres niet bekend
79 2e adres niet bekend
82 2e adres niet bekend
83 2e adres niet bekend
84 2e adres niet bekend
85 2e adres niet bekend
88 2e adres niet bekend
89 2e adres niet bekend
90 2e adres niet bekend
91 2e adres niet bekend
92 2e adres niet bekend
93 2e adres niet bekend
94 2e adres niet bekend
95 2e adres niet bekend
96 2e adres niet bekend
97 2e adres niet bekend
98 2e adres niet bekend
99 2e adres niet bekend
101 2e adres niet bekend
102 2e adres niet bekend
104 2e adres niet bekend
105 2e adres niet bekend
106 2e adres niet bekend
107 2e adres niet bekend
108 2e adres niet bekend
109 2e adres niet bekend
111 2e adres niet bekend
112 2e adres niet bekend
113 2e adres niet bekend
114 2e adres niet bekend
115 2e adres niet bekend
116 2e adres niet bekend
117 2e adres niet bekend
118 2e adres niet bekend
119 2e adres niet bekend
120 2e adres niet bekend
121 2e adres niet bekend
122 2e adres niet bekend
123 2e adres niet bekend
126 2e adres niet bekend
128 2e adres niet bekend
129 2e adres niet bekend
130 2e adres niet bekend
132 2e adres niet bekend
133 2e adres niet bekend
134 2e adres niet bekend
135 2e adres niet bekend
136 2e adres niet bekend
137 2e adres niet bekend
139 2e adres niet bekend
140 2e adres niet bekend
141 2e adres niet bekend
142 2e adres niet bekend
143 2e adres niet bekend
144 2e adres niet bekend
147 2e adres niet bekend
148 2e adres niet bekend
150 2e adres niet bekend
151 2e adres niet bekend
152 2e adres niet bekend
154 2e adres niet bekend
155 2e adres niet bekend
156 2e adres niet bekend
157 2e adres niet bekend
158 2e adres niet bekend
159 2e adres niet bekend
160 2e adres niet bekend
161 2e adres niet bekend
162 2e adres niet bekend
163 2e adres niet bekend
164 2e adres niet bekend
165 2e adres niet bekend
166 2e adres niet bekend
197 2e adres niet bekend
198 2e adres niet bekend
199 2e adres niet bekend
200 2e adres niet bekend
201 2e adres niet bekend
202 2e adres niet bekend
205 2e adres niet bekend
206 2e adres niet bekend
208 2e adres niet bekend
209 2e adres niet bekend
211 2e adres niet bekend
212 2e adres niet bekend
214 2e adres niet bekend
216 2e adres niet bekend
217 2e adres niet bekend
218 2e adres niet bekend
220 2e adres niet bekend
221 2e adres niet bekend
223 2e adres niet bekend
260 2e adres niet bekend
261 2e adres niet bekend
262 2e adres niet bekend
263 2e adres niet bekend
264 2e adres niet bekend
265 2e adres niet bekend
266 2e adres niet bekend
267 2e adres niet bekend
268 2e adres niet bekend
269 2e adres niet bekend
270 2e adres niet bekend
271 2e adres niet bekend
272 2e adres niet bekend
273 2e adres niet bekend
274 2e adres niet bekend
275 2e adres niet bekend
276 2e adres niet bekend
277 2e adres niet bekend
278 2e adres niet bekend
279 2e adres niet bekend
280 2e adres niet bekend
281 2e adres niet bekend
282 2e adres niet bekend
283 2e adres niet bekend
284 2e adres niet bekend
285 2e adres niet bekend
286 2e adres niet bekend
287 2e adres niet bekend
288 2e adres niet bekend
289 2e adres niet bekend
290 2e adres niet bekend
291 2e adres niet bekend
304 2e adres niet bekend
305 2e adres niet bekend
306 2e adres niet bekend
307 2e adres niet bekend
308 2e adres niet bekend
309 2e adres niet bekend
310 2e adres niet bekend
311 2e adres niet bekend
312 2e adres niet bekend
313 2e adres niet bekend
314 2e adres niet bekend
315 2e adres niet bekend
316 2e adres niet bekend
318 2e adres niet bekend
319 2e adres niet bekend
326 2e adres niet bekend
327 2e adres niet bekend
328 2e adres niet bekend
329 2e adres niet bekend
330 2e adres niet bekend
331 2e adres niet bekend
332 2e adres niet bekend
333 2e adres niet bekend
336 2e adres niet bekend
337 2e adres niet bekend
338 2e adres niet bekend
339 2e adres niet bekend
340 2e adres niet bekend
341 2e adres niet bekend
342 2e adres niet bekend
343 2e adres niet bekend
344 2e adres niet bekend
345 2e adres niet bekend
346 2e adres niet bekend
357 2e adres niet bekend
358 2e adres niet bekend
360 2e adres niet bekend
361 2e adres niet bekend
362 2e adres niet bekend
363 2e adres niet bekend
364 2e adres niet bekend
365 2e adres niet bekend
366 2e adres niet bekend
377 2e adres niet bekend
378 2e adres niet bekend
379 2e adres niet bekend
380 2e adres niet bekend
381 2e adres niet bekend
382 2e adres niet bekend
385 2e adres niet bekend
386 2e adres niet bekend
389 2e adres niet bekend
393 2e adres niet bekend
394 2e adres niet bekend
395 2e adres niet bekend
396 2e adres niet bekend
397 2e adres niet bekend
398 2e adres niet bekend
399 2e adres niet bekend
401 2e adres niet bekend
402 2e adres niet bekend
411 2e adres niet bekend
412 2e adres niet bekend
413 2e adres niet bekend
414 2e adres niet bekend
415 2e adres niet bekend
416 2e adres niet bekend
417 2e adres niet bekend
418 2e adres niet bekend
419 2e adres niet bekend
420 2e adres niet bekend
421 2e adres niet bekend
422 2e adres niet bekend
423 2e adres niet bekend
424 2e adres niet bekend
425 2e adres niet bekend
426 2e adres niet bekend
427 2e adres niet bekend
429 2e adres niet bekend
430 2e adres niet bekend
431 2e adres niet bekend
432 2e adres niet bekend
433 2e adres niet bekend
434 2e adres niet bekend
435 2e adres niet bekend
436 2e adres niet bekend
437 2e adres niet bekend
438 2e adres niet bekend
439 2e adres niet bekend
440 2e adres niet bekend
441 2e adres niet bekend
442 2e adres niet bekend
443 2e adres niet bekend

286

Geef de gemiddelde kostprijs van de verkochte producten waarop korting (unit_sale_price < unit_price) is verleend (1 waarde)

In [16]:
sales = pd.read_sql("select * from order_details", conn)

gem_kostprijs = sales.loc[sales["UNIT_SALE_PRICE"] < sales["UNIT_PRICE"], "UNIT_COST"].mean()
float(round(gem_kostprijs, 2))

127.34

Geef een overzicht met daarin het aantal medewerkers per medewerkersfunctie (2 kolommen, 7 rijen)

In [17]:
med = pd.read_sql("select * from sales_staff", conn)

med.groupby("POSITION_EN").size().reset_index(name="AANTAL")

                    POSITION_EN  AANTAL
0                Branch Manager      19
1              District Manager       4
2               General Manager       1
3  Level 1 Sales Representative      13
4  Level 2 Sales Representative      39
5  Level 3 Sales Representative      24
6              Regional Manager       2

Geef een overzicht met daarin per telefoonnummer het aantal medewerkers dat op dat telefoonnummer bereikbaar is. Toon alleen de telefoonnummer waarop meer dan 4 medewerkers bereikbaar zijn. (2 kolommen, 10 rijen)

In [18]:
emp = pd.read_sql("select * from sales_staff", conn)

overzicht = (
    emp.groupby("WORK_PHONE").size()
       .reset_index(name="AANTAL_MEDEWERKERS")
       .query("AANTAL_MEDEWERKERS > 4")
)

overzicht
# waarom de NBSP

             WORK_PHONE  AANTAL_MEDEWERKERS
4     +(44) 121 3505267                   5
10  +(61) 03 2982  4242                   5
11  +31 (0)20 692 93 94                   5
13    +33 1 68 94 52 20                   5
18     1 (206) 292-0012                   5
19     1 (305) 557-4810                   6
20     1 (310) 281-5722                   5
21     1 (403) 232-5986                   5
22     1 (416) 493-5595                   5
23     1 (617) 268-6754                   6

## Selecties op meerdere tabellen zonder functies

Geef een overzicht met daarin het eerste adres en de stad van vestigingen van klanten uit ‘Netherlands’ (2 kolommen, 20 rijen)

In [19]:
sites = pd.read_sql("select * from retailer_site", conn)
country = pd.read_sql("select * from country", conn)

sites.merge(
    country[["COUNTRY_CODE", "COUNTRY"]],
        on="COUNTRY_CODE",
        how="left").loc[lambda df: df["COUNTRY_CODE"] == 7,
    ["ADDRESS1", "CITY"]]

                      ADDRESS1          CITY
240                   Beets 36         Beets
241               Perestraat 1      Deventer
242  Laan van Meerdervoort 966      Den Haag
243             Kalfjeslaan 47    Amstelveen
244               Startbaan 11    Amstelveen
245      Noorderspoorsingel 28     Groningen
246              Hogehilweg 13     Amsterdam
247             Spoorstraat 43    Varsseveld
248             Westhavenweg 8     Amsterdam
249              Westzeedijk 4        Muiden
250            Gooiergracht 91         Laren
251            Hoofdstraat 150   Pieterburen
252                Olde Diek 2         Laren
253     Amsterdamsestraatweg 8      Maarssen
254        Krayenhoffstraat 11     Amsterdam
255         Overschiestraat 19     Amsterdam
256              Havenbuurt 12        Marken
257               Duivendaal 1    Wageningen
258              Voorstraat 37  Nieuweschans
259         Stadhouderslaan 18     Rotterdam

Geef een overzicht met daarin de productnamen die tot het producttype ‘Eyewear’ behoren. (1 kolom, 5 rijen)

In [20]:
p = pd.read_sql("select * from product", conn)
t = pd.read_sql("select * from product_type", conn)

p.merge(
    t[["PRODUCT_TYPE_CODE","PRODUCT_TYPE_EN"]],
        on="PRODUCT_TYPE_CODE").query("PRODUCT_TYPE_EN == 'Eyewear'")[["PRODUCT_NAME"]].drop_duplicates()

     PRODUCT_NAME
67      Polar Sun
68      Polar Ice
69   Polar Sports
70     Polar Wave
71  Polar Extreme

Geef een overzicht met daarin alle unieke eerste adressen van klantvestigingen en de voornaam en achternaam van de verkopers die ‘Branch Manager’ zijn en aan deze vestigingen hebben verkocht (3 kolommen, 1 rij)

In [21]:
sites  = pd.read_sql("select * from retailer_site", conn)
orders = pd.read_sql("select * from order_header", conn)
staff  = pd.read_sql("select * from sales_staff", conn)

orders.merge(
    sites[["RETAILER_SITE_CODE","ADDRESS1"]],
        on="RETAILER_SITE_CODE").merge(staff[["SALES_STAFF_CODE","FIRST_NAME","LAST_NAME","POSITION_EN"]],
        on="SALES_STAFF_CODE").query("POSITION_EN == 'Branch Manager'")[["ADDRESS1","FIRST_NAME","LAST_NAME"]].drop_duplicates()

                  ADDRESS1 FIRST_NAME LAST_NAME
3185  Alameda Santos, 9876     Bayard     Lopes

Geef een overzicht met daarin van de verkopers hun functie en indien zij iets hebben verkocht de datum waarop de verkoop heeft plaatsgevonden. Laat alleen de verschillende namen van de posities zien van de verkopers die het woord ‘Manager’ in hun positienaam hebben staan. (2 kolommen, 7 rijen)

In [37]:
staff = pd.read_sql("SELECT SALES_STAFF_CODE, POSITION_EN FROM sales_staff", conn)
orders = pd.read_sql("SELECT SALES_STAFF_CODE, ORDER_DATE FROM order_header", conn)

staff[staff["POSITION_EN"].str.contains("Manager", na=False)].merge(
    orders, on="SALES_STAFF_CODE", how="left"
).groupby("POSITION_EN")["ORDER_DATE"].min().reset_index()

        POSITION_EN  ORDER_DATE
0    Branch Manager  2024-01-09
1  District Manager         NaN
2   General Manager         NaN
3  Regional Manager         NaN

Geef een overzicht met daarin de verschillende namen van producten en bijbehorende namen van producttypen van de producten waarvoor ooit meer dan 750 stuks tegelijk verkocht zijn. (2 kolommen, 9 rijen)

In [23]:
od = pd.read_sql("select * from order_details", conn)
p  = pd.read_sql("select * from product", conn)
pt = pd.read_sql("select * from product_type", conn)

od.merge(
    p[["PRODUCT_NUMBER","PRODUCT_NAME","PRODUCT_TYPE_CODE"]],
            on="PRODUCT_NUMBER").merge(pt[["PRODUCT_TYPE_CODE","PRODUCT_TYPE_EN"]],
            on="PRODUCT_TYPE_CODE").loc[lambda df: df["QUANTITY"] > 750,
            ["PRODUCT_NAME","PRODUCT_TYPE_EN"]].drop_duplicates()

                PRODUCT_NAME    PRODUCT_TYPE_EN
539        BugShield Extreme  Insect Repellents
1759                Star Peg              Tents
20121  BugShield Lotion Lite  Insect Repellents
20147         Sun Shelter 15          Sunscreen
20152         Sun Shelter 30          Sunscreen
31236        BugShield Spray  Insect Repellents
37272              Firefly 2           Lanterns
37348       BugShield Lotion  Insect Repellents
37363             Sun Shield          Sunscreen

Geef een overzicht met daarin de productnamen waarvan ooit meer dan 40% korting is verleend. De formule voor korting is: (unit_price - unit_sale_price) / unit_price (1 kolom, 8 rijen)

In [24]:
od = pd.read_sql("select * from order_details", conn)
p  = pd.read_sql("select * from product", conn)

od["KORTING"] = (od["UNIT_PRICE"] - od["UNIT_SALE_PRICE"]) / od["UNIT_PRICE"]

od.loc[
    od["KORTING"] > 0.40,
    ["PRODUCT_NUMBER"]].merge(p[["PRODUCT_NUMBER","PRODUCT_NAME"]],
    on="PRODUCT_NUMBER")[["PRODUCT_NAME"]].drop_duplicates()

                    PRODUCT_NAME
0              BugShield Natural
1                BugShield Spray
2   Hailstorm Titanium Woods Set
3          BugShield Lotion Lite
4                 Sun Shelter 30
5              BugShield Extreme
7                 Sun Shelter 15
10              BugShield Lotion

Geef een overzicht met daarin de retourreden van producten waarvan ooit meer dan 90% van de aangeschafte hoeveelheid is teruggebracht (return_quantity/quantity). (1 kolom, 3 rijen)

In [25]:
ret = pd.read_sql("select * from returned_item", conn)
od  = pd.read_sql("select * from order_details", conn)
rr  = pd.read_sql("select * from return_reason", conn)

df = ret.merge(
    od[["ORDER_DETAIL_CODE","QUANTITY"]],
        on="ORDER_DETAIL_CODE").merge(rr[["RETURN_REASON_CODE","RETURN_DESCRIPTION_EN"]],
        on="RETURN_REASON_CODE")

df.loc[(df["RETURN_QUANTITY"] / df["QUANTITY"]) > 0.90, ["RETURN_DESCRIPTION_EN"]].drop_duplicates()

    RETURN_DESCRIPTION_EN
0  Unsatisfactory product
2   Wrong product shipped
3   Wrong product ordered

## Selecties op meerdere tabellen met functies

Geef een overzicht met daarin per producttype het aantal producten die tot dat producttype behoren. (2 kolommen, 21 rijen)

In [26]:
p  = pd.read_sql("select * from product", conn)
pt = pd.read_sql("select * from product_type", conn)

p.merge(pt[["PRODUCT_TYPE_CODE","PRODUCT_TYPE_EN"]], on="PRODUCT_TYPE_CODE")\
 .groupby("PRODUCT_TYPE_EN")["PRODUCT_NUMBER"].nunique()\
 .reset_index(name="AANTAL_PRODUCTEN")

         PRODUCT_TYPE_EN  AANTAL_PRODUCTEN
0             Binoculars                 4
1   Climbing Accessories                 7
2           Cooking Gear                10
3                Eyewear                 5
4              First Aid                 5
5       Golf Accessories                 4
6      Insect Repellents                 5
7                  Irons                 4
8                 Knives                 5
9               Lanterns                12
10            Navigation                 4
11                 Packs                 6
12               Putters                 3
13                  Rope                 4
14                Safety                 4
15         Sleeping Bags                 7
16             Sunscreen                 5
17                 Tents                 6
18                 Tools                 6
19               Watches                 5
20                 Woods                 4

Geef een overzicht met daarin per land het aantal vestigingen van klanten die zich in dat land bevinden. (2 kolommen, 21 rijen)

In [27]:
sites = pd.read_sql("select * from retailer_site", conn)
country = pd.read_sql("select * from country", conn)

sites.merge(country[["COUNTRY_CODE","COUNTRY"]], on="COUNTRY_CODE")\
     .groupby("COUNTRY")["RETAILER_SITE_CODE"].nunique()\
     .reset_index(name="AANTAL_VESTIGINGEN")

           COUNTRY  AANTAL_VESTIGINGEN
0        Australia                  10
1          Austria                  10
2          Belgium                  10
3           Brazil                   1
4           Canada                  31
5            China                  10
6          Denmark                   6
7          Finland                   5
8           France                  29
9          Germany                  32
10           Italy                  12
11           Japan                  25
12           Korea                  10
13          Mexico                  10
14     Netherlands                  20
15           Spain                   9
16          Sweden                  12
17     Switzerland                  13
18          Taiwan                  10
19  United Kingdom                  25
20   United States                 101

Geef een overzicht met daarin van de producten behorend tot het producttype ‘Cooking Gear’ per productnaam de totaal verkochte hoeveelheid en de gemiddelde verkoopprijs. Sorteer de uitkomst op totaal verkochte hoeveelheid. (6 kolommen, 10 rijen)

In [28]:
od = pd.read_sql("select * from order_details", conn)
p  = pd.read_sql("select * from product", conn)
pt = pd.read_sql("select * from product_type", conn)

df = od.merge(p, on="PRODUCT_NUMBER").merge(pt[["PRODUCT_TYPE_CODE","PRODUCT_TYPE_EN"]], on="PRODUCT_TYPE_CODE")

overzicht = (df[df["PRODUCT_TYPE_EN"]=="Cooking Gear"]
            .groupby("PRODUCT_NAME")
            .agg(TOTAAL_VERKOCHT=("QUANTITY","sum"),
                 GEM_VERKOOPPRIJS=("UNIT_SALE_PRICE","mean"))
            .reset_index()
            .sort_values("TOTAAL_VERKOCHT", ascending=False))

overzicht

                PRODUCT_NAME  TOTAAL_VERKOCHT  GEM_VERKOOPPRIJS
9        TrailChef Water Bag            36738          6.032506
2              TrailChef Cup            27418          6.976490
0          TrailChef Canteen            26544         11.979418
6      TrailChef Kitchen Kit            22206         22.345975
8         TrailChef Utensils            13776         17.294151
4     TrailChef Double Flame            12476        132.672882
1         TrailChef Cook Set            10878         51.687926
5           TrailChef Kettle             8826         12.201235
7     TrailChef Single Flame             8504         63.827622
3  TrailChef Deluxe Cook Set             3110        121.217638

Geef een overzicht met daarin per land de naam van het land, de naam van de stad waar de verkoopafdeling is gevestigd (noem de kolomnaam in het overzicht ‘verkoper’) en het aantal steden waar zich klanten bevinden in dat land (noem de kolomnaam in het overzicht ‘klanten’) (3 kolommen, 29 rijen)

In [3]:
branches = pd.read_sql("select * from sales_branch", conn)
sites    = pd.read_sql("select * from retailer_site", conn)
country  = pd.read_sql("select * from country", conn)

klanten = sites.groupby("COUNTRY_CODE")["CITY"].nunique().reset_index(name="klanten")

overzicht = (
    branches.merge(country[["COUNTRY_CODE","COUNTRY"]], on="COUNTRY_CODE", how="left")
            .merge(klanten, on="COUNTRY_CODE", how="left")
            .rename(columns={"CITY":"verkoper"})
            [["COUNTRY","verkoper","klanten"]]
)

overzicht

           COUNTRY          verkoper  klanten
0           France             Paris       14
1            Italy            Milano        9
2      Netherlands         Amsterdam       15
3          Germany           Hamburg       18
4          Germany           München       18
5           Sweden             Kista       10
6           Canada           Calgary       16
7           Canada           Toronto       16
8    United States            Boston       62
9    United States           Seattle       62
10   United States       Los Angeles       62
11   United States             Miami       62
12          France              Lyon       14
13          Mexico  Distrito Federal        6
14           Japan             Tokyo        5
15           Japan        Osaka City        5
16       Australia         Melbourne        6
17           Spain            Bilbao        5
18          Brazil         São Paulo        1
19         Finland            Kuopio        5
20           Korea             Seoul        6
21          Taiwan         San Chung        9
22           China          Shanghai        7
23  United Kingdom            London        9
24  United Kingdom        Birmingham        9
25     Switzerland            Zürich        9
26         Belgium          Heverlee        8
27         Austria              Wien        9

## Pythonvertalingen van SUBSELECT en UNION met o.a. for-loops

Geef een overzicht met daarin de voornaam en de achternaam van de medewerkers die nog nooit wat hebben verkocht (2 kolommen, 25 rijen)

In [37]:
staff  = pd.read_sql("select * from sales_staff", conn)
orders = pd.read_sql("select * from order_header", conn)

verkocht_codes = set(orders["SALES_STAFF_CODE"].dropna())
nooit_verkocht = staff[~staff["SALES_STAFF_CODE"].isin(verkocht_codes)][["FIRST_NAME","LAST_NAME"]]

nooit_verkocht

   FIRST_NAME      LAST_NAME
0       Denis           Pagé
5        Else         Mörike
6       Frank          Fuchs
9       Fritz         Hirsch
10       Jörg          Kunze
12      Maria      Iacobucci
17       Kick        Kalkman
22      Karin      Bergström
25      Sally          White
27      Frank        Bretton
28    Georges  Saint-Germain
33       Alex      Rodriguez
37   Samantha          Floyd
41      Julie          Olsen
45      Corey         Wright
51    Estelle        Johnson
52       Greg        Belding
55      Julie        Béchard
59      Lucía          Reyna
64     Kazumi        Uragome
66      Alice         Walter
84     Walter         Taylor
85   Penelope        Tamrine
88      Polly         Linton
96      Gracy        Gellens

Geef een overzicht met daarin het aantal producten waarvan de marge lager is dan de gemiddelde marge van alle producten samen. Geef in het overzicht tevens aan wat de gemiddelde marge is van dit aantal producten waarvan de marge lager dan de gemiddelde marge van alle producten samen is. (1 kolom, 2 rijen)

In [38]:
p = pd.read_sql("select * from product", conn)

gem_alles = p["MARGIN"].mean()
lager = p[p["MARGIN"] < gem_alles]

overzicht = pd.DataFrame({
    "waarde": [len(lager), round(lager["MARGIN"].mean(), 2)]
}, index=["aantal_producten", "gem_marge_lager_dan_gem"])

overzicht

                         waarde
aantal_producten          59.00
gem_marge_lager_dan_gem    0.29

Geef een overzicht met daarin de namen van de producten die voor meer dan 500 (verkoopprijs) zijn verkocht maar nooit zijn teruggebracht. (1 kolom, 13 rijen)

In [39]:
od  = pd.read_sql("select * from order_details", conn)
ret = pd.read_sql("select * from returned_item", conn)
p   = pd.read_sql("select * from product", conn)

duur = set(od.loc[
    (od["UNIT_SALE_PRICE"] > 500) | ((od["UNIT_SALE_PRICE"] * od["QUANTITY"]) > 500),
    "PRODUCT_NUMBER"
])

terug = set(ret.merge(od[["ORDER_DETAIL_CODE","PRODUCT_NUMBER"]], on="ORDER_DETAIL_CODE")["PRODUCT_NUMBER"])

p.loc[p["PRODUCT_NUMBER"].isin(duur - terug), ["PRODUCT_NAME"]].drop_duplicates()

len(duur), len(terug), len(duur - terug)
#fout gemaakt??

(115, 110, 5)

Geef een overzicht met daarin per (achternaam van) medewerker of hij/zij manager is of niet, door deze informatie toe te voegen als extra 'Ja/Nee'-kolom.<br>
Hint: gebruik een for-loop waarin je o.a. bepaalt of het woord 'Manager' in de functie (position_en) staat. (2 kolommen, 102 rijen).

In [40]:
emp["POSITION_EN"]

0                    Branch Manager
1      Level 3 Sales Representative
2      Level 1 Sales Representative
3      Level 2 Sales Representative
4      Level 2 Sales Representative
                   ...
97     Level 1 Sales Representative
98     Level 1 Sales Representative
99     Level 3 Sales Representative
100    Level 2 Sales Representative
101    Level 3 Sales Representative
Name: POSITION_EN, Length: 102, dtype: str

In [41]:
emp = pd.read_sql("select * from sales_staff", conn)

is_manager = []
for pos in emp["POSITION_EN"]:
    is_manager.append("Ja" if "Manager" in str(pos) else "Nee")

overzicht = emp[["LAST_NAME"]].copy()
overzicht["Manager"] = is_manager
overzicht

     LAST_NAME Manager
0         Pagé      Ja
1       Michel     Nee
2     Clermont     Nee
3       Jauvin     Nee
4    Wiesinger     Nee
..         ...     ...
97    Laermans     Nee
98     De Crée     Nee
99     Lattrez     Nee
100  Seefelder     Nee
101     Grüner     Nee

[102 rows x 2 columns]

Met de onderstaande code laat je Python het huidige jaar uitrekenen.

In [42]:
from datetime import date
date.today().year

2026

Met de onderstaande code selecteer je op een bepaald jaartal uit een datum.

In [43]:
from datetime import datetime

date_str = '16-8-2013'
date_format = '%d-%m-%Y'
date_obj = datetime.strptime(date_str, date_format)

date_obj.year

2013

Geef met behulp van bovenstaande hulpcode een overzicht met daarin op basis van het aantal jaar dat iemand in dienst is of een medewerker ‘kort in dienst’ (minder dan 30 jaar in dienst) of een ‘lang in dienst’ (groter dan gelijk aan 30 jaar in dienst) is. Geef daarbij per medewerker in een aparte kolom zowel ‘kort in dienst’ als ‘lang in dienst’ aan. Gebruik (wederom) een for-loop.<br>
(2 kolommen, 102 rijen)

In [44]:
emp = pd.read_sql("select * from sales_staff", conn)

dienst = []
for d in pd.to_datetime(emp["DATE_HIRED"]):
    dienst.append("kort in dienst" if (pd.Timestamp.today().year - d.year) < 30 else "lang in dienst")

emp[["LAST_NAME"]].assign(DIENSTVERBAND=dienst)

     LAST_NAME   DIENSTVERBAND
0         Pagé  lang in dienst
1       Michel  lang in dienst
2     Clermont  kort in dienst
3       Jauvin  kort in dienst
4    Wiesinger  kort in dienst
..         ...             ...
97    Laermans  kort in dienst
98     De Crée  kort in dienst
99     Lattrez  kort in dienst
100  Seefelder  kort in dienst
101     Grüner  kort in dienst

[102 rows x 2 columns]